---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LightType
source: html/42c83d85-60cd-52c3-7b97-b89e81d7d9fe.htm
---
# Autodesk.Revit.DB.Lighting.LightType

This class encapsulates light information.

## Syntax (C#)
```csharp
public class LightType : IDisposable
```